In [1]:
import pandas as pd

In [8]:
name = pd.Series(["小/陈", "小/李", "小/王", "小/张", "小/赵", "小/周"],
                 index=["1", "002", "003", "004", "005", "006"])
gender = pd.Series(["女", "女", "男", "男", "女", "男"],
                index=["006", "005", "004", "003", "002", "1"])
height = pd.Series([172.5, 168.0, 178.2, 181.3, 161.7],
                   index=["1", "002", "003", "004", "005"])

In [13]:
student = pd.DataFrame({'姓名':name,'性别':gender,'身高':height})
student

      姓名 性别     身高
002  小/李  女  168.0
003  小/王  男  178.2
004  小/张  男  181.3
005  小/赵  女  161.7
006  小/周  女    NaN
1    小/陈  男  172.5

#### 对数据进行转置

In [14]:
student.T

      002    003    004    005  006      1
姓名    小/李    小/王    小/张    小/赵  小/周    小/陈
性别      女      男      男      女    女      男
身高  168.0  178.2  181.3  161.7  NaN  172.5

#### 对列进行拆分用split方法

In [15]:
student['姓名']

002    小/李
003    小/王
004    小/张
005    小/赵
006    小/周
1      小/陈
Name: 姓名, dtype: object

#### 传出一个列表

In [17]:
student['姓名'].str.split('/')

002    [小, 李]
003    [小, 王]
004    [小, 张]
005    [小, 赵]
006    [小, 周]
1      [小, 陈]
Name: 姓名, dtype: object

#### 加上expand参数

In [18]:
student['姓名'].str.split('/',expand=True)

     0  1
002  小  李
003  小  王
004  小  张
005  小  赵
006  小  周
1    小  陈

#### 添加新的列 若添加的列名已经存在则更新，若不存在则添加新列

In [21]:
student[['新1','新2']]=student['姓名'].str.split('/',expand=True)
student

      姓名 性别     身高 新1 新2
002  小/李  女  168.0  小  李
003  小/王  男  178.2  小  王
004  小/张  男  181.3  小  张
005  小/赵  女  161.7  小  赵
006  小/周  女    NaN  小  周
1    小/陈  男  172.5  小  陈

#### 删除原来的列

In [22]:
student=student.drop('姓名',axis=1)
student

    性别     身高 新1 新2
002  女  168.0  小  李
003  男  178.2  小  王
004  男  181.3  小  张
005  女  161.7  小  赵
006  女    NaN  小  周
1    男  172.5  小  陈

#### 合并列str.cat

In [23]:
student['新1'].str.cat(student['新2'])

002    小李
003    小王
004    小张
005    小赵
006    小周
1      小陈
Name: 新1, dtype: object

#### 用sep来指定拼接的分隔符

In [24]:
student['新1'].str.cat(student['新2'],sep='/')

002    小/李
003    小/王
004    小/张
005    小/赵
006    小/周
1      小/陈
Name: 新1, dtype: object

#### 把宽数据转化为长数据（把一部分列名的值转化为变量的值）

#### 可以用melt方法可以传入参数                                                  1.要处理的df                                                                     2.di_vars赋值我不为改变的列                                                     3.var_name赋值为包含原本列名值的新列名                                         4.value_name赋值为转换后df中包含原本变量值的新列列名

### ~~~~~~~~~~~~~~~~~~~~~~~~~

#### 对行进行拆分可以使用explode方法

#### 对行或列进行删除可以用drop方法，若不指定axis时会默认为零执行删除行，而指定axis=1时执行删除列